app/controllers/event_controller.rb

SELECT `events`.* FROM `events` ORDER BY start ASC LIMIT 10
---
  def index
    # limit = 10 ?
    # order by start DESC ?
    # ?
    @events = Event.limit(10).order("start ASC").group_by { |event|

SELECT `events`.* FROM `events` WHERE `events`.`id` = 2 LIMIT 1
---
  def show
    # Doesn't seem very secure ... !
    @event = Event.find(params[:id])